Config/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторНачислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьНалогообложенияНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Comment>Код по классификатору видов экономической деятельности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Comment>Наименование по классификатору видов экономической деятельности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КППИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/БанковскиеИКазначейскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеИКазначейскиеСчета</Name>
			<Comment>Банковские и казначейские счета контрагентов и органов казначейства (финансовых органов)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Казначейства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтрактПоГОЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеОборонныеЗаказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентИНН</Name>
					<Comment>ИНН корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентКПП</Name>
					<Comment>КПП корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентТекст</Name>
					<Comment>Наименование корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестонахождениеФилиалаБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаНеУказывается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйСчетГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/РаботаСКонтрагентамиПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПроверкаКонтрагентовВДокументах

// Формирование описания расположения счета-фактуры в документе.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Форма документа-основания, для которого необходимо получить описание счета-фактуры.
//  Описание - ТаблицаЗначений - Таблица, в которую помещается описание счета-фактуры.
//				Структура колонок указана в функции ШаблонТаблицыОписания модуля ПроверкаКонтрагентов.
//
//@skip-warning
Процедура СформироватьОписаниеДокументовСоСчетомФактуройВПодвале(Форма, Описание) Экспорт
	
		
КонецПроцедуры

// Формирование описания расположения контрагента, находящегося в шапке документа.
//
// Параметры:
//  Форма	 - УправляемаяФорма - Форма документа, для которой необходимо получить описание расположения контрагента.
//  Описание - ТаблицаЗначений - Таблица, в которую помещается описание контрагентов.
//				Структура колонок указана в функции ШаблонТаблицыОписания модуля ПроверкаКонтрагентов.
Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Форма, Описание) Экспорт
	
	ДокументОбъект = Форма.Объект;
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	// Заполнение данных по контрагенту в шапке.
	Если ПроверкаКонтрагентовКлиентСервер.ЭтоДокументСКонтрагентомВШапке(Форма) Тогда
		
		Документы[ДокументСсылка.Метаданные().Имя].СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма);
			
	КонецЕсли;
		
КонецПроцедуры

// Формирование описания  расположения контрагентов, находящихся в табличной части документа.
//
// Параметры:
//  Форма	 - УправляемаяФорма - Форма документа, для которой необходимо получить описание.
//  Описание - ТаблицаЗначений - Таблица с описанием расположения контрагентов в табличной части документа.
//				Структура колонок указана в функции ШаблонТаблицыОписанияТабличныхЧастей модуля ПроверкаКонтрагентов.
Процедура СформироватьОписаниеДокументовСТабличнымиЧастями(Форма, Описание) Экспорт
	
	ДокументОбъект = Форма.Объект;
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Если ПроверкаКонтрагентовКлиентСервер.ЭтоДокументСКонтрагентомВТабличнойЧасти(Форма) Тогда
		
		Документы[ДокументСсылка.Метаданные().Имя].СформироватьОписаниеДокументовСТабличнымиЧастями(Форма, Описание);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирование описания расположения контрагентов в счете-фактуре.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Форма счета-фактуры, для которой необходимо получить описание.
//  Описание - ТаблицаЗначений - Таблица, в которую помещается описание контрагентов.
//				Структура колонок указана в функции ШаблонТаблицыОписания модуля ПроверкаКонтрагентов.
//
//@skip-warning
Процедура СформироватьОписаниеСчетовФактур(Форма, Описание) Экспорт
	
		
КонецПроцедуры

// Возвращает массив имен реквизитов счета-фактуры, содержащих контрагентов.
//
// Параметры:
//  Тип	 			- Тип - Тип счета-фактуры, для которой необходимо получить описание.
//  ИменаРеквизитов	- Массив из Строка - массив имен реквизитов счета-фактуры, содержащих контрагентов.
//
//@skip-warning
Процедура ПолучитьИменаРеквизитовКонтрагентовВСчетеФактуре(Тип, ИменаРеквизитов) Экспорт
	

КонецПроцедуры

// Получение даты документа, в котором используется проверка контрагентов.
// 		Проверка контрагентов будет выполняться по состоянию на эту дату. 
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект - Документ, в котором используется проверка контрагентов.
//  Дата			 - Дата - Результат получения даты документа.
Процедура ОпределитьДатуВДокументе(ДокументОбъект, Дата) Экспорт
	
	Дата = НачалоДня(ДокументОбъект.Дата);
	
КонецПроцедуры

// Определение даты в счете-фактуре.
//
// Параметры:
//  СчетФактураОбъект	 - ДанныеФормыСтруктура, ДокументОбъект - Счет-фактура, чью дату необходимо получить.
//  Дата				 - Дата - Результат, дата счета-фактуры.
//
//@skip-warning
Процедура ОпределитьДатуВСчетеФактуре(СчетФактураОбъект, Дата) Экспорт
	
	
КонецПроцедуры

// Возможность переопределить стандартное заполнение данных о контрагентах в счет-фактурах, созданных на основании документа.
//
// Параметры:
//  СтандартнаяОбработка - Булево - необходимо установить в Ложь, если стандартная обработка переопределяется.
//  ДокументОбъект       - Произвольный - данные содержащие информацию о счет-фактурах.
//  ДанныеКонтрагентов   - ТаблицаЗначений - подготавливаемая таблица с данными о контрагентах.
//  Форма                - ФормаКлиентскогоПриложения, Неопределено - Форма из которой выполняется вызов.
//
//@skip-warning
Процедура ЗаполнитьДанныеКонтрагентовВСчетеФактуре(СтандартнаяОбработка, ДокументОбъект, ДанныеКонтрагентов, Форма) Экспорт
	
	
	
КонецПроцедуры

// Возможность переопределить стандартное сохранение результатов проверки контрагентов счет-фактур, выписанных на основании
//             документа основания в форме документа основания. 
//
// Параметры:
//  СтандартнаяОбработка - Булево - необходимо установить в Ложь, если стандартная обработка переопределяется.
//  ДанныеКонтрагентов   - ТаблицаЗначений - подготавливаемая таблица с данными о контрагентах.
//  Форма                - ФормаКлиентскогоПриложения, Неопределено - Форма из которой выполняется вызов.
//
//@skip-warning
Процедура ЗапомнитьРезультатПроверкиКонтрагентовСчетФактурыВДокументе(СтандартнаяОбработка, ДанныеКонтрагентов, Форма) Экспорт
	
	
	
КонецПроцедуры

// Возможность дополнить структуру РеквизитыПроверкиКонтрагентов при создании в форме документа.
//
// Параметры:
//   Форма          - ФормаКлиентскогоПриложения, Неопределено - Форма из которой выполняется вызов.
//   НовыеРеквизиты - Структура - сформированная структура дополнительных реквизитов документа, которая может быть дополнена.
//
//@skip-warning
Процедура ДополнитьРеквизитыФормыДокумент(Форма, НовыеРеквизиты) Экспорт


КонецПроцедуры

// Возможность переопределить сохраняемые результаты проверки контрагентов в документе.
//
// Параметры:
//  СтандартнаяОбработка - Булево - необходимо установить в Ложь, если стандартная обработка переопределяется.
//  СохраняемоеЗначение  - Соответствие - сохраняемые данные.
//  Форма                - ФормаКлиентскогоПриложения, Неопределено - Форма из которой выполняется вызов.
//
//@skip-warning
Процедура СохраняемыеРезультатыПроверкиСчетФактурыВДокументе(СтандартнаяОбработка, СохраняемоеЗначение, Форма) Экспорт
	
	
	
КонецПроцедуры

// Отображения результата проверки контрагента в документе.
//
// Параметры:
//  Форма	 				- ФормаКлиентскогоПриложения - Форма документа, для которого выводится результат проверки контрагента.
//		Результат проверки хранится в реквизите РеквизитыПроверкиКонтрагентов(Структура) формы документа.
//		Структуру полей РеквизитыПроверкиКонтрагентов см. процедуре ИнициализироватьРеквизитыФормыДокумент ОМ
//		ПроверкаКонтрагентов.
//  СтандартнаяОбработка	- Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                  процедуре.
//
//@skip-warning
Процедура ОтобразитьРезультатПроверкиКонтрагентаВДокументе(Форма, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Прорисовать состояния контрагентов в документе.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - Форма документа, в котором выполняется проверка контрагентов.
//  СостояниеПроверки		 - Перечисления.СостоянияПроверкиКонтрагентов	 - Указывает, в каком состояние проверка:
//  	завершилась, не завершилась, выполняется или отсутствует доступ к веб-сервису.
//  ДополнительныеПараметры	 - Неопределено, Структура - Параметры, показывающие в каком элементе формы произошло
//  												изменение и это изменение вызвало запуск проверки контрагента. Описание структуры см в
//  												ПроверкаКонтрагентовКлиентСервер.ПараметрыФоновогоЗадания.
//  СтандартнаяОбработка	 - Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//  										процедуре.
//  										Пример см в ПроверкаКонтрагентов.ПрорисоватьСостоянияКонтрагентовВДокументе.
//
//@skip-warning
Процедура ПрорисоватьСостоянияКонтрагентовВДокументе(Форма, СостояниеПроверки, ДополнительныеПараметры = Неопределено, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Установка условного оформления в форме выбора или списка документов.
//
// Параметры:
//  Список				 	 - ДинамическийСписок - Динамический список формы выбора или списка документов.
//  СтандартнаяОбработка	 - Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                   процедуре.
//
//@skip-warning
Процедура УстановитьУсловноеОформлениеСпискаДокументов(Список, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Установка условного оформления в табличной части документа.
//
// Параметры:
//  Форма				 	 - ФормаКлиентскогоПриложения - Форма документа, в котором выполняется проверка контрагентов.
//  СтандартнаяОбработка	 - Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                   процедуре.
//
//@skip-warning
Процедура УстановитьУсловноеОформлениеТабличнойЧастиДокумента(Форма, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Добавление колонки с результатом проверки контрагента в таблицу формы документа.
//
// Параметры:
//  Форма				 	 - ФормаКлиентскогоПриложения - Форма документа, в котором выполняется проверка контрагентов.
//  СтандартнаяОбработка	 - Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                   процедуре.
//
//@skip-warning
Процедура ДобавитьКолонкиТаблицыФормыСРезультатамиПроверкиВТабличныеЧасти(Форма, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Добавление строки с данными проверяемого контрагента при проверке контрагентов в документе.
//
// Параметры:
//	СтандартнаяОбработка - Булево - признак выполнения стандартной обработки.
//		Значение по умолчанию - Истина;
//	Ссылка - ДокументСсылка - ссылка на документ, в котором выполняется проверка контрагентов;
//	ДанныеКонтрагентов - ТаблицаЗначений - содержит данные проверяемых контрагентов.
//		Структуру колонок таблицы см. в функции ШаблонТаблицыДанныеКонтрагента;
//	Контрагент - ОпределяемыйТип.КонтрагентБИП - проверяемый контрагент, ссылка на
//		элемент справочника контрагентов;
//	Дата - Дата - дата, на которую выполняется проверка;
//	Состояние - ПеречислениеСсылка.СостоянияПроверкиКонтрагентов - текущее состояние
//		проверки существования контрагента.
//
//@skip-warning
Процедура ДобавитьСтрокуВДанныеКонтрагентовВДокументе(
	СтандартнаяОбработка,
	Ссылка,
	ДанныеКонтрагентов,
	Контрагент,
	Дата,
	Состояние = Неопределено) Экспорт
	
	СтандартнаяОбработка = НЕ Контрагент = Неопределено И Метаданные.ОпределяемыеТипы.КонтрагентБИП.Тип.СодержитТип(ТипЗнч(Контрагент)); 
	
	Если СтандартнаяОбработка Тогда
		ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ВидКонтрагента");
		СтандартнаяОбработка = НЕ ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.УчетнаяГруппа");  
	КонецЕсли;	
	
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаКонтрагентовВОтчетах

// Выделение контрагента с ошибкой в строке отчета.
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент - Табличный документ отчета, в котором выделяется строка с некорректным
//                                           контрагентом.
//  НомерСтроки			 - Число - Номер строки табличного документа, в которой находится некорректный контрагент.
//
//@skip-warning
Процедура ВыделитьКонтрагентаСОшибкойВСтрокеОтчета(ТабличныйДокумент, НомерСтроки) Экспорт
	
	
КонецПроцедуры

// Предназначена для формирования отчета, в котором используется проверка контрагентов, из общего модуля.
//
// Параметры:
//  ПараметрыФормированияОтчета	 - Структура - Параметры, с которыми необходимо сформировать отчет.
//  Отчет						 - ТабличныйДокумент - результат формирования отчета.
//
//@skip-warning
Процедура СформироватьОтчет(ПараметрыФормированияОтчета, Отчет = Неопределено) Экспорт
	
	
КонецПроцедуры 

// Вывод результата проверки контрагента в поле табличного документа.
//
// Параметры:
//  Форма				 		 - ФормаКлиентскогоПриложения - Форма отчета, в котором выполняется проверка контрагентов.
//  ПолеТабличногоДокумента		 - ПолеФормы - поле, в которое необходимо выводить отчет.
//  РезультатФормированияОтчета	 - ТабличныйДокумент - Документ, предназначенный для вывода в поле формы.
//  СтандартнаяОбработка		 - Булево - Определяет, выполнять ли действие, определенное в данной процедуре или выполнить
//                                    стандартную обработку.
//
//@skip-warning
Процедура ВывестиОтчет(Форма, ПолеТабличногоДокумента, РезультатФормированияОтчета, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вывод раздела отчета с проверкой контрагента в поле табличного документа.
//
// Параметры:
//  Форма				 		 - ФормаКлиентскогоПриложения - Форма отчета, в котором выполняется проверка контрагентов.
//  ПолеТабличногоДокумента		 - ПолеФормы - поле, в которое необходимо выводить отчет.
//  НомерРаздела	 			 - Число - Номер раздела отчета.
//  СтандартнаяОбработка		 - Булево - Определяет, выполнять ли действие, определенное в данной процедуре или выполнить
//                                    стандартную обработку.
//
//@skip-warning
Процедура ВывестиРазделОтчета(Форма, ПолеТабличногоДокумента, НомерРаздела, СтандартнаяОбработка) Экспорт

	

КонецПроцедуры

// Определяет, нужно ли выводить данную строку в отчете по некорректным контрагентам.
// 	Пример см. в ПроверкаКонтрагентов.ВыводитьСтрокуОтчета.
//
// Параметры:
//  СтруктураПараметров	 - Структура - Параметры формирования отчета. 
//		Для проверки контрагентов в отчете важно наличие ключа "ДанныеДляПроверкиКонтрагентов".
//		Данный ключ формируется в процедуре ДобавитьПараметрыДляПроверкиКонтрагентов.
//  Контрагент				- СправочникСсылка - Проверяемый контрагент в строке отчета.
//  ИНН						- Строка - ИНН контрагента.
//  КПП						- Строка - ИНН контрагента.
//  Дата					- Дата - Дата, на которую необходимо выполнять проверку контрагента.
//  СтандартнаяОбработка	- Булево - Определяет, выполнять ли действие, определенное в данной процедуре или выполнить
//                                  стандартную обработку.
//  Результат				- Булево - Определяет, нужно ли выводить строку.
//
//@skip-warning
Процедура ОпределитьНужноЛиВыводитьСтрокуОтчета(СтруктураПараметров, Контрагент, ИНН, КПП, Дата, Результат, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Определяет, нужно ли проверять контрагентов в разделе отчета.
//
// Параметры:
//  СтруктураПараметров	 - Структура - Параметры формирования отчета. 
//		Для проверки контрагентов в отчете важно наличие ключа "ДанныеДляПроверкиКонтрагентов".
//		Данный ключ формируется в процедуре ДобавитьПараметрыДляПроверкиКонтрагентов.
//  НомерРаздела			- Число - Номер раздела отчета.
//  ДополнительныеПараметры	- Произвольный - Дополнительная информация, связанная с разделом.
//  СтандартнаяОбработка	- Булево - Определяет, выполнять ли действие, определенное в данной процедуре или выполнить
//                                  стандартную обработку.
//
//@skip-warning
Процедура ОпределитьНужноЛиПроверятьКонтрагентовВРазделеОтчета(СтруктураПараметров, НомерРаздела, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Отображения результата проверки контрагента в отчете.
//
// Параметры:
//  Форма	 				- ФормаКлиентскогоПриложения - Форма отчета, для которого выводится результат проверки контрагента.
//		Результат проверки хранится в реквизите РеквизитыПроверкиКонтрагентов(Структура),
//		ПроверкаКонтрагентовНедействующиеКонтрагенты формы отчета.
//		Структуру полей РеквизитыПроверкиКонтрагентов см. процедуре ИнициализироватьРеквизитыФормыОтчета ОМ
//		ПроверкаКонтрагентов.
//  СтандартнаяОбработка	- Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                  процедуре.
//
//@skip-warning
Процедура ОтобразитьРезультатПроверкиКонтрагентаВОтчете(Форма, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Установка условного оформления в форме выбора или списка справочника контрагентов.
//
// Параметры:
//  Список				 	 - ДинамическийСписок - Динамический список формы выбора или списка справочника контрагентов.
//  СтандартнаяОбработка	 - Булево - Если Ложь, то игнорируется стандартное действие и выполняется указанное в данной
//                                   процедуре.
//
//@skip-warning
Процедура УстановитьУсловноеОформлениеСпискаКонтрагентов(Список, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаКонтрагентовВСправочнике

// Важно: заполнение реализации метода обязательно.
// Определяет свойства справочников контрагентов.
// Параметры:
//	СвойстваСправочников - ТаблицаЗначений - в таблице заполняется список
//		справочников контрагентов и их свойства. Колонки таблицы:
//		* Имя - Строка - имя справочника;
//		* Иерархический - Булево - справочник является иерархическим;
//		* РеквизитИНН - Строка- имя реквизита ИНН;
//		* РеквизитКПП - Строка- имя реквизита КПП;
//		* ОтключитьСозданиеИзДосьеКонтрагента - Булево - если Истина,
//			тогда не будет предлагаться создание элемента справочника из
//			отчета "Досье контрагента".
//
Процедура ПриОпределенииСвойствСправочниковКонтрагентов(СвойстваСправочников) Экспорт
	
	НовСтр = СвойстваСправочников.Добавить();
	НовСтр.Имя 				= "Контрагенты";
	НовСтр.Иерархический 	= Истина;
	НовСтр.РеквизитИНН 		= "ИНН"; 
	НовСтр.РеквизитКПП      = "КПП"; 
	
КонецПроцедуры

// Определяет, является ли контрагент физическим или юридическим лицом.
//
// Параметры:
//  СтандартнаяОбработка  - Булево - если стандартный механизм переопределяется, то должно быть установлено значение "Ложь".
//  ЭтоЮрЛицо             - Булево - Истина, если юридическое лицо, и Ложь, если физическое.
//  ДанныеКонтрагента     - Структура - структура, которая содержит данные обрабатываемого контрагента.
//
Процедура ПриОпределенииВидаКонтрагента(СтандартнаяОбработка, ЭтоЮрЛицо, ДанныеКонтрагента) Экспорт

	Если ДанныеКонтрагента.ДополнительныеПараметры.Свойство("ЭтоЮридическоеЛицо") Тогда
		ЭтоЮрЛицо = ДанныеКонтрагента.ДополнительныеПараметры.ЭтоЮридическоеЛицо;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Определяется, является ли контрагент иностранным.
//
// Параметры:
//  ДанныеКонтрагента   - СтрокаТаблицыЗначений - Содержит информацию о контрагенте. 
//      Подробнее о колонках таблицы можно узнать в описании к процедуре ПроверкаКонтрагентов.ШаблонТаблицыДанныеКонтрагента().
//  ЯвляетсяИностранным - Булево - Результат проверки.
Процедура ПриОпределенииКонтрагентЯвляетсяИностранным(ДанныеКонтрагента, ЯвляетсяИностранным) Экспорт
	
	КонтрагентСсылка = ДанныеКонтрагента.Контрагент;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(КонтрагентСсылка)) 
		И НЕ КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтрагентСсылка, "ЮридическоеФизическоеЛицо");
		
		СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮридическоеФизическоеЛицо, "СтранаРегистрации");
		
		ЯвляетсяИностранным = НЕ (СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));;
			
	Иначе
		
		ЯвляетсяИностранным = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяется, необходимо ли отключить проверку состояния контрагента в базе ФНС.
//
// Параметры:
//  ДанныеКонтрагента - СтрокаТаблицыЗначений:
//    * Контрагент - Произвольный - ссылки на все справочники, описанные в методе
//        см. РаботаСКонтрагентами.СвойстваСправочниковКонтрагентов.
//    * ИНН - Строка
//    * КПП - Строка
//    * ЭтоЮридическоеЛицо - Неопределено, Булево
//    * ЭтоИностранныйКонтрагент - Неопределено, Булево
//    * ОтключитьПроверкуФНС - Неопределено, Булево
//    * ПричинаОтключенияПроверкиФНС - Строка
//    * Дата - Дата - дата актуальности состояния.
//    * ДополнительныеПараметры - Структура - дополнительные сведения о контрагенте.
//    * Состояние - ПеречислениеСсылка.СостоянияСуществованияКонтрагента
//    * ОбластьДанныхВспомогательныеДанные - Число - добавляется если внедрена подсистема РаботаВМоделиСервиса.
//  ОтключитьПроверкуФНС - Булево, Неопределено - результат проверки состояния контрагента. Если установить Истина, то
//    проверка состояния контрагента в базе ФНС выполняться не будет.
//  ПричинаОтключения - Строка - краткое описание причины отключения проверки контрагента. Установленный текст будет
//    отображаться в окне подсказки поля контрагента, если параметр ОтключитьПроверкуФНС будет установлен в значение
//    Истина.
//
//@skip-warning
Процедура ПриОпределенииСтатусаПроверкиКонтрагентаВБазеФНС(
	ДанныеКонтрагента,
	ОтключитьПроверкуФНС,
	ПричинаОтключения) Экспорт  
	
	КонтрагентСсылка = ДанныеКонтрагента.Контрагент;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(КонтрагентСсылка)) 
		И НЕ КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		СвойстваКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтрагентСсылка, "ЮридическоеФизическоеЛицо,ВидКонтрагента"); 
		
		Если СвойстваКонтрагента.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.УчетнаяГруппа") Тогда
            ОтключитьПроверкуФНС = Истина;
			ПричинаОтключения = "УчетнаяГруппа";
		ИначеЕсли ЗначениеЗаполнено(СвойстваКонтрагента.ЮридическоеФизическоеЛиц) 
			И ОбщегоНазначения.СсылкаСуществует(СвойстваКонтрагента.ЮридическоеФизическоеЛицо) Тогда 
			
			Если СвойстваКонтрагента.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
				
				СвойстваИП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СвойстваКонтрагента.ЮридическоеФизическоеЛицо, "ОГРНИП,ИНН");
				
				Если НЕ ЗначениеЗаполнено(СвойстваИП.ОГРНИП) ИЛИ НЕ ЗначениеЗаполнено(СвойстваИП.ИНН) Тогда
					ОтключитьПроверкуФНС = Истина;
					ПричинаОтключения = "Физлицо";
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ОтключитьПроверкуФНС = Истина;
		КонецЕсли;
		
	Иначе
		ОтключитьПроверкуФНС = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Возможность дополнить структуру РеквизитыПроверкиКонтрагентов для формы справочника. 
//
// Параметры:
//  Форма  - УправляемаяФорма - форма, для которой дополняется структура РеквизитыПроверкиКонтрагентов.
//  НовыеРеквизиты  - Структура - структура, которая транслируется в реквизит формы РеквизитыПроверкиКонтрагентов.
//
Процедура ДополнитьРеквизитыФормыКонтрагент(Форма, НовыеРеквизиты) Экспорт
	
	НовыеРеквизиты.ЭтоЮридическоеЛицо = Форма.Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
	
	НовыеРеквизиты.ЭтоИностранныйКонтрагент =
	?(Форма.Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"),
	  НЕ (Форма.ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ Форма.ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка")),
		НЕ (Форма.ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ Форма.ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка")));   
		
	НовыеРеквизиты.ОтключитьПроверкуФНС =
	Форма.Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо")
	И (НЕ ЗначениеЗаполнено(Форма.ФизическоеЛицо.ОГРНИП) ИЛИ НЕ ЗначениеЗаполнено(Форма.ФизическоеЛицо.ИНН))
	ИЛИ Форма.Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.УчетнаяГруппа");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеИнформацииДляДосьеКонтрагента

// Определение состава и порядка вывода в отчет "Досье контрагента" данных из информационной базы.
//
// Параметры:
//  ТаблицаОписания - ТаблицаЗначений - описание см. Отчеты.ДосьеКонтрагента.НоваяТаблицаОписаниеДанныхПрограммы.
//
Процедура ЗаполнитьОписаниеДанныхПрограммы(ТаблицаОписания) Экспорт

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Наименование";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Наименование'");
	
	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Реквизиты";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Реквизиты'");
	
	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "ЮридическийАдрес";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Юридический адрес'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "ФактическийАдрес";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Фактический адрес'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "ПочтовыйАдрес";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Почтовый адрес'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "КонтактныеЛица";
	НоваяСтрока.ЭтоТаблица = Истина;
	НоваяСтрока.Заголовок = НСтр("ru='Контактные лица'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "БанковскиеСчета";
	НоваяСтрока.ЭтоТаблица = Истина;
	НоваяСтрока.Заголовок = НСтр("ru='Банковские счета'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Договоры";
	НоваяСтрока.ЭтоТаблица = Истина;
	НоваяСтрока.Заголовок = НСтр("ru='Договоры'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Телефон";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Телефон'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Email";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Email'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Родитель";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Входит в группу'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "Комментарий";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Комментарий'");

	НоваяСтрока = ТаблицаОписания.Добавить();
	НоваяСтрока.ИмяДанных = "ДополнительнаяИнформация";
	НоваяСтрока.ЭтоТаблица = Ложь;
	НоваяСтрока.Заголовок = НСтр("ru='Дополнительная информация'");
	
КонецПроцедуры

// Заполнение информации о контрагенте по данным информационной базы для отчета "Досье контрагента".
//
// Параметры:
//  ИнформацияОСвязях  - Структура - описание см. РаботаСКонтрагентами.НоваяИнформацияОСвязяхЮридическогоЛица
//                 и РаботаСКонтрагентами.НоваяИнформацияОСвязяхПредпринимателя.
//                 При заполнении в структуру ИнформацияОСвязях.ДанныеПрограммы добавляются данные о контрагенте.
//                 Ключи структуры должны соответствовать полям ИмяДанных таблицы, заполненной 
//                 в процедуре ЗаполнитьОписаниеДанныхПрограммы.
//  Контрагент  - ОпределяемыйТип.КонтрагентБИП - ссылка на контрагента в информационной базе.
//                 Если при вызове процедуры ссылка пустая, необходимо найти контрагента до данным,
//                 содержащимся в структуре ИнформацияОСвязях.
//
Процедура ДополнитьИнформациюДаннымиПрограммы(ИнформацияОСвязях, Контрагент) Экспорт
		
#Область ЗаполнениеСсылкиНаКонтрагента
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда	
		
		Запрос = Новый Запрос;
		Если ИнформацияОСвязях.Свойство("КПП") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Спр
			|ГДЕ
			|	Спр.ИНН = &ИНН
			|	И (Спр.КПП = &КПП ИЛИ Спр.КПП = """")";
			Запрос.УстановитьПараметр("КПП", ИнформацияОСвязях.КПП);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Спр
			|ГДЕ
			|	Спр.ИНН = &ИНН";
		КонецЕсли;
		Запрос.УстановитьПараметр("ИНН", ИнформацияОСвязях.ИНН);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Контрагент = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
#КонецОбласти

#Область ЗаполнениеРеквизитовКонтрагента

	Наименование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, 
	"Ссылка,Наименование,НаименованиеСокращенное,ИНН,КПП,Родитель,"
	+"ВидКонтрагента,ЮридическоеФизическоеЛицо");

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Наименование", Отчеты.ДосьеКонтрагента.НовыеДанныеПрограммы());
	ИнформацияОСвязях.ДанныеПрограммы.Наименование.Ссылка 			= Наименование.Ссылка;
	ИнформацияОСвязях.ДанныеПрограммы.Наименование.Представление 	= Наименование.Наименование;
	ИнформацияОСвязях.ДанныеПрограммы.Наименование.Описание 		= Наименование.НаименованиеСокращенное;

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Реквизиты", Отчеты.ДосьеКонтрагента.НовыеДанныеПрограммы());

	Реквизиты = Новый Структура("РегистрационныйНомер"); 

	Если Наименование.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		Реквизиты.РегистрационныйНомер = "ОГРН";
		ВидКонтрагента = НСтр("ru='Юридическое лицо'");
		ИнформацияОСвязях.ДанныеПрограммы.Реквизиты.Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='КПП %1'"),
		Наименование.КПП);
		Если ЗначениеЗаполнено(ИнформацияОСвязях.КПП)
			И Наименование.КПП <> ИнформацияОСвязях.КПП Тогда
			ИнформацияОСвязях.ДанныеПрограммы.Реквизиты.ПримечаниеОписание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='По данным ЕГРЮЛ: 
			|КПП %1'"),
			ИнформацияОСвязях.КПП);
		КонецЕсли;
	Иначе	
		Реквизиты.РегистрационныйНомер = "ОГРНИП";
		ВидКонтрагента = НСтр("ru='Физическое лицо'");
	КонецЕсли;	

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Наименование.ЮридическоеФизическоеЛицо, Реквизиты);

	ИнформацияОСвязях.ДанныеПрограммы.Реквизиты.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='ИНН %1, ОГРН %2'"),
	Наименование.ИНН,
	Реквизиты.РегистрационныйНомер);

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("ВидКонтрагента", ВидКонтрагента);

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Родитель",    Наименование.Родитель);
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Комментарий", "");
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("ДополнительнаяИнформация", "");
	
#КонецОбласти	

#Область ЗаполнениеБанковскихСчетовКонтрагента

	БанковскиеСчета = Отчеты.ДосьеКонтрагента.НоваяТаблицаДанныеПрограммы();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Казначейский)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКазначейскийСчет,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Казначейский)
	|			ТОГДА БанковскиеСчета.КассовыйОрган.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Казначейство,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Казначейский)
	|			ТОГДА БанковскиеСчета.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЛицевойСчет
	|ИЗ
	|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		РеквизитыПолучателя = Новый Структура("НомерСчета, Банк, БИК, КоррСчет",
		"СчетНомер", "Банк", "БИК", "КоррСчет");
		
		ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Выборка.Ссылка, Выборка.Ссылка, РеквизитыПолучателя, , Ложь);
		
		НоваяСтрока = БанковскиеСчета.Добавить();
		Представление = "";
		Описание = "";
		
		Если ЗначениеЗаполнено(РеквизитыПолучателя.КоррСчет) Тогда
			
			Если Выборка.ЭтоКазначейскийСчет Тогда
				
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1, р/с %2, БИК %3, корр. счет %3'"),
				РеквизитыПолучателя.Банк,
				РеквизитыПолучателя.НомерСчета,
				РеквизитыПолучателя.БИК,
				РеквизитыПолучателя.КоррСчет);
				
				Описание  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1, л/с %2'"),
				Выборка.Казначейство,
				Выборка.ЛицевойСчет);
				
			Иначе	
				
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='р/с %1, БИК %2, корр. счет %3'"),
				РеквизитыПолучателя.НомерСчета,
				РеквизитыПолучателя.БИК,
				РеквизитыПолучателя.КоррСчет);
				
				Описание      = РеквизитыПолучателя.Банк;
				
			КонецЕсли;	
		Иначе
			Если Выборка.ЭтоКазначейскийСчет Тогда
				
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1, р/с %2, БИК %3'"),
				РеквизитыПолучателя.Банк,
				РеквизитыПолучателя.НомерСчета,
				РеквизитыПолучателя.БИК);
				
				Описание  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1, л/с %2'"),
				Выборка.Казначейство,
				Выборка.ЛицевойСчет);
				
			Иначе
				
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='р/с %1, БИК %2'"),
				РеквизитыПолучателя.НомерСчета,
				РеквизитыПолучателя.БИК);
				
				Описание      = РеквизитыПолучателя.Банк;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		НоваяСтрока.Представление = Представление;
		НоваяСтрока.Описание      = Описание;
		НоваяСтрока.Ссылка        = Выборка.Ссылка;
		
	КонецЦикла;

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("БанковскиеСчета", БанковскиеСчета);

#КонецОбласти

#Область ЗаполнениеКонтактныхЛицКонтрагента
	
	КонтактныеЛица = Отчеты.ДосьеКонтрагента.НоваяТаблицаДанныеПрограммы();
	
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("КонтактныеЛица", КонтактныеЛица);

#КонецОбласти

#Область ЗаполнениеДоговоровКонтрагента

	Договоры  = Отчеты.ДосьеКонтрагента.НоваяТаблицаДанныеПрограммы();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.Организация.Наименование КАК НаименованиеОрганизации,
	|	ДоговорыКонтрагентов.КраткоеСодержание КАК Описание
	|ИЗ
	|	Справочник.Договоры КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НаименованиеОрганизации";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаРезультата Цикл
		
		НоваяСтрока   = Договоры.Добавить();
		Представление = СтрокаТаблицы.Наименование + " (" + СтрокаТаблицы.НаименованиеОрганизации + ")";
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Представление = Представление;
		
	КонецЦикла;

	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Договоры", Договоры);

#КонецОбласти

#Область ЗаполнениеКонтактнойИнформацииКонтрагента

	ЮридическийАдрес = Отчеты.ДосьеКонтрагента.НовыеДанныеПрограммы();
	
	РеквизитыКонтр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, 
	"Ссылка, ВидКонтрагента, ЮридическоеФизическоеЛицо");
	
	Если РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		ВидАдр = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
	ИначеЕсли РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ВидАдр = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
	КонецЕсли;	
	
	ЮридическийАдрес.Представление = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
	РеквизитыКонтр.ЮридическоеФизическоеЛицо, ВидАдр);
		
	Если ИнформацияОСвязях.Свойство("ЮридическийАдрес")  
		И ЗначениеЗаполнено(ИнформацияОСвязях.ЮридическийАдрес)
		И ЗначениеЗаполнено(ИнформацияОСвязях.ЮридическийАдрес.Представление) Тогда
		// Проверяем возможные расхождения адреса в программе с ЕГРЮЛ.
		// Адреса сравниваем неточно, без корпуса и квартиры (текст внутри первых 5 запятых стандартного адреса).
		Если ЗначениеЗаполнено(ЮридическийАдрес.Представление) Тогда
			ВсегоЗапятыхДляСравнения = 5;
			// Адрес программы
			АдресПрограммы = "";
			КоличествоЗапятых = 0;
			Для НомерСимвола = 1 По СтрДлина(ЮридическийАдрес.Представление) Цикл
				ТекущийСимвол = Сред(ЮридическийАдрес.Представление, НомерСимвола, 1);
				Если ТекущийСимвол = "," Тогда
					КоличествоЗапятых = КоличествоЗапятых + 1;
					Если КоличествоЗапятых >= ВсегоЗапятыхДляСравнения Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				АдресПрограммы = АдресПрограммы + ТекущийСимвол;
			КонецЦикла;
			// Адрес реестра
			АдресРеестра = "";
			КоличествоЗапятых = 0;
			Для НомерСимвола = 1 По СтрДлина(ИнформацияОСвязях.ЮридическийАдрес.Представление) Цикл
				ТекущийСимвол = Сред(ИнформацияОСвязях.ЮридическийАдрес.Представление, НомерСимвола, 1);
				Если ТекущийСимвол = "," Тогда
					КоличествоЗапятых = КоличествоЗапятых + 1;
					Если КоличествоЗапятых >= ВсегоЗапятыхДляСравнения Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				АдресРеестра = АдресРеестра + ТекущийСимвол;
			КонецЦикла;
			ВывестиПримечание = АдресПрограммы <> АдресРеестра;
		Иначе
			ВывестиПримечание = Ложь;
		КонецЕсли;
		
		Если ВывестиПримечание Тогда
			ЮридическийАдрес.ПримечаниеПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По данным ЕГРЮЛ: 
					|%1'"),
				ИнформацияОСвязях.ЮридическийАдрес.Представление);
		КонецЕсли;
		
	КонецЕсли;
	
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("ЮридическийАдрес", ЮридическийАдрес);
  
	Если РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		ВидАдр = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты;
	ИначеЕсли РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ВидАдр = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
	КонецЕсли;	
	
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("ФактическийАдрес", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		РеквизитыКонтр.ЮридическоеФизическоеЛицо, ВидАдр));
		
	Если ЗначениеЗаполнено(ИнформацияОСвязях.ДанныеПрограммы.ФактическийАдрес)
			И ИнформацияОСвязях.ДанныеПрограммы.ФактическийАдрес = ИнформацияОСвязях.ДанныеПрограммы.ЮридическийАдрес.Представление Тогда
		ИнформацияОСвязях.ДанныеПрограммы.ФактическийАдрес = НСтр("ru='Совпадает с юридическим адресом'");
	КонецЕсли;
	
	////Почтового адреса у нас нет	
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("ПочтовыйАдрес", ""); 
	
	Если РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		ВидАдр = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты;
	ИначеЕсли РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ВидАдр = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица;
	КонецЕсли;
	
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		РеквизитыКонтр.ЮридическоеФизическоеЛицо, ВидАдр));
		
	Если РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		ВидАдр = Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты;
	ИначеЕсли РеквизитыКонтр.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ВидАдр = Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица;
	КонецЕсли;
		
	ИнформацияОСвязях.ДанныеПрограммы.Вставить("Email", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		РеквизитыКонтр.ЮридическоеФизическоеЛицо, ВидАдр));

#КонецОбласти
	
КонецПроцедуры 

// Заполнение идентификатора конфигурации для статистики переходов по ссылкам сервиса 1С:Контрагент.
//
// Параметры:
//  ИдентификаторКонфигурации  - Строка - идентификатор. 
//                 Рекомендуется использовать латинские строчные буквы и цифры.
//
//@skip-warning
Процедура ЗаполнитьИдентификаторКонфигурации(ИдентификаторКонфигурации) Экспорт


КонецПроцедуры

#КонецОбласти 

#Область ПрочиеПроцедуры

// Определение цветов выделения результатов проверки контрагентов.
// 		Для примера см. функцию ЦветаРезультатовПроверки ОМ ПроверкаКонтрагентовКлиентСервер.
//
// Параметры:
//  Цвета	 - Структура - Имена ключей - это названия цветов, которые необходимо определить.
// 		Список ключей см ПроверкаКонтрагентовВызовСервера.ЦветаРезультатовПроверки().
//
//@skip-warning
Процедура ПриОпределенииЦветовРезультатовПроверки(Цвета) Экспорт
	
КонецПроцедуры

// Заполнение значений колонок ЭтоЮридическоеЛицо и ЭтоИностранныйКонтрагент 
//		в таблице с данными контрагента.
//		Заполнять следует запросом и только те строки, в которых значения не заполнены.
//
// Параметры:
//  ДанныеКонтрагентов	 - ТаблицаЗначений - Таблица с данными контрагентов.
//  СтандартнаяОбработка - Булево - Если Истина, то заполнение будет выполнено стандартным 
// 		образом путем перебора каждой строки таблицы.
//
Процедура ДополнитьДанныеКонтрагентов(ДанныеКонтрагентов, СтандартнаяОбработка) Экспорт  
	
	Если ОбщегоНазначения.РазделениеВключено()
        И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()
        ИЛИ НЕ ОбщегоНазначения.РазделениеВключено() Тогда

        СтандартнаяОбработка = Ложь;

        // При определении реквизитов ЭтоЮридическоеЛицо и ЭтоИностранныйКонтрагент есть ветки,
        // когда соответствующий элемент справочника может отсутствовать (ДанныеКонтрагентов.Ссылка IS NULL).
        // Такое может возникнуть, когда 
        // - проверяется объект (ссылки еще нет)
        // - в Досье контрагента, когда при проверке используется только ИНН и КПП, с самой
        // ссылки нет.
        // - при использовании функций ПроверитьКонтрагента и СостояниеКонтрагента ОМ
        // ПроверкаКонтрагентов извне как API без указания ссылки в параметре запуска.
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ДанныеКонтрагентов.Контрагент КАК Контрагент,
        |	ДанныеКонтрагентов.ИНН КАК ИНН,
        |	ДанныеКонтрагентов.КПП КАК КПП,
        |	ДанныеКонтрагентов.ЭтоЮридическоеЛицо КАК ЭтоЮридическоеЛицо,
        |	ДанныеКонтрагентов.ЭтоИностранныйКонтрагент КАК ЭтоИностранныйКонтрагент,
        |	ДанныеКонтрагентов.ОтключитьПроверкуФНС КАК ОтключитьПроверкуФНС,
        |	ДанныеКонтрагентов.ПричинаОтключенияПроверкиФНС КАК ПричинаОтключенияПроверкиФНС,
        |	ДанныеКонтрагентов.Дата КАК Дата,
        |	ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
        |	ДанныеКонтрагентов.Состояние КАК Состояние
        |ПОМЕСТИТЬ ДанныеКонтрагентов
        |ИЗ
        |	&ДанныеКонтрагентов КАК ДанныеКонтрагентов
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	ДанныеКонтрагентов.Контрагент КАК Контрагент,
        |	ДанныеКонтрагентов.ИНН КАК ИНН,
        |	ДанныеКонтрагентов.КПП КАК КПП,
        |	ВЫБОР
        |		КОГДА ДанныеКонтрагентов.ЭтоЮридическоеЛицо = НЕОПРЕДЕЛЕНО
        |			ТОГДА ВЫБОР
        |					КОГДА Контрагенты.ВидКонтрагента ЕСТЬ NULL
        |						ТОГДА ВЫБОР
        |								КОГДА ПОДСТРОКА(ДанныеКонтрагентов.ИНН, 12, 1) <> """"
        |									ТОГДА ЛОЖЬ
        |								ИНАЧЕ ИСТИНА
        |							КОНЕЦ
        |					ИНАЧЕ ВЫБОР
        |							КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
        |								ТОГДА ИСТИНА
        |							ИНАЧЕ ЛОЖЬ
        |						КОНЕЦ
        |				КОНЕЦ
        |		ИНАЧЕ ДанныеКонтрагентов.ЭтоЮридическоеЛицо
        |	КОНЕЦ КАК ЭтоЮридическоеЛицо,
        |	ВЫБОР
        |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо ЕСТЬ NULL
        |			ТОГДА ЛОЖЬ
        |		ИНАЧЕ ВЫБОР
        |				КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
        |						И НЕ(Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
        |								ИЛИ Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
        |					ТОГДА ИСТИНА
        |				ИНАЧЕ ЛОЖЬ
        |			КОНЕЦ
        |	КОНЕЦ КАК ЭтоИностранныйКонтрагент,
        |	ВЫБОР
        |		КОГДА ДанныеКонтрагентов.ОтключитьПроверкуФНС = ИСТИНА
        |			ТОГДА ИСТИНА 
		|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.УчетнаяГруппа)
        |			ТОГДА ИСТИНА
        |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо ЕСТЬ NULL
        |			ТОГДА ЛОЖЬ
        |		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
        |				И (Контрагенты.ЮридическоеФизическоеЛицо.ОГРНИП = """"
        |					ИЛИ Контрагенты.ЮридическоеФизическоеЛицо.ИНН = """")
        |			ТОГДА ИСТИНА
        |		КОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент <> НЕОПРЕДЕЛЕНО
        |			ТОГДА ДанныеКонтрагентов.ЭтоИностранныйКонтрагент
        |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
        |				ИЛИ Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
        |			ТОГДА ЛОЖЬ
        |		ИНАЧЕ ИСТИНА
        |	КОНЕЦ КАК ОтключитьПроверкуФНС,
        |	ДанныеКонтрагентов.ПричинаОтключенияПроверкиФНС КАК ПричинаОтключенияПроверкиФНС,
        |	ДанныеКонтрагентов.Дата КАК Дата,
        |	ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
        |	ДанныеКонтрагентов.Состояние КАК Состояние
        |ИЗ
        |	ДанныеКонтрагентов КАК ДанныеКонтрагентов
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
        |		ПО ДанныеКонтрагентов.Контрагент = Контрагенты.Ссылка";

        Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда

            Запрос.Текст = СтрЗаменить(
            Запрос.Текст,
            "ДанныеКонтрагентов.ОбластьДанныхВспомогательныеДанные,",
            "");

        КонецЕсли;

        Запрос.УстановитьПараметр("ДанныеКонтрагентов", ДанныеКонтрагентов);
        ДанныеКонтрагентов = Запрос.Выполнить().Выгрузить();

    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
